---
kind: type
id: T:Autodesk.Revit.DB.DirectContext3D.VertexStreamPositionNormal
source: html/fc9b191e-cbd9-844c-0289-b58ccc19ac8b.htm
---
# Autodesk.Revit.DB.DirectContext3D.VertexStreamPositionNormal

A stream that can be used to write vertices of type VertexPositionNormal
 into a buffer (see VertexBuffer ).

## Syntax (C#)
```csharp
public class VertexStreamPositionNormal : VertexStream
```